app/controllers/comments_controller.rb

	def create
		@shop = Shop.find(params[:shop_id])
		@comment = @shop.comments.create(params[:comment])
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`body`, `commenter`, `created_at`, `shop_id`, `updated_at`) VALUES ('12313123', 'jerry', '2012-08-16 14:40:19', 1, '2012-08-16 14:40:19')

	def destroy
		@shop = Shop.find(params[:shop_id])
		@comment = @shop.comments.find(params[:id])
		@comment.destroy
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`shop_id` = 1 AND `comments`.`id` = 3 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 3