app/controllers/shops_controller.rb

SELECT `shops`.* FROM `shops`
---
  def index
    @shops = Shop.all

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def show
    @shop = Shop.find(params[:id])

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def edit
    @shop = Shop.find(params[:id])

INSERT INTO `shops` (`address`, `created_at`, `description`, `logo`, `name`, `slogan`, `updated_at`, `weight`) VALUES ('康派B座', '2012-08-16 13:17:02', 'test', '', '割烹清水', '装逼的日本料理', '2012-08-16 13:17:02', NULL)
---
  def create
    @shop = Shop.new(params[:shop])

    respond_to do |format|
      if @shop.save

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def update
    @shop = Shop.find(params[:id])